TrainCase/case2/0/I1_4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I1_4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
-1.33905e-05
-0.0734178
-5.79661e-05
-64.4817
-0.0037417
-0.000204211
-5.61488
-0.307607
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
-2.17862e+71
-5.28713e+70
-1.05112e+70
-5.27185e+68
-1.26966e+68
-1.57385e+66
-1.69012e+65
-6.30901e+65
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-517.55
-281.745
-38.8046
0
0
0
0
-640.782
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-4.7817e-08
-0.000108413
-1.89412e-06
-0.0101133
-3.58875e-05
-3.58943e-05
-0.000269903
-0.000278327
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0
0
-125.666
-13.2878
0
0
0
-5.96154
...
)
;
    }
}


// ************************************************************************* //
