TrainCase/case2/0/I2_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.000287768
3.16639e-06
0.00598585
2.19744e-07
0.000800034
0.00930847
1.45735e-07
0.000108683
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0.00202324
3.85419e-06
2.4759e-07
1.63225e-07
1.79816e-07
2.05463e-07
2.27421e-07
2.38764e-07
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2.97565e-79
9.17288e-79
4.6049e-77
8.15677e-75
2.43326e-77
9.58846e-75
1.22135e-75
1.71674e-79
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.049248
0.0563179
0.0772132
0.0592846
0.0605713
0.0610639
0.061569
0.0611962
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
6.82167e-78
3.88859e-81
7.39898e-79
6.07598e-77
2.35859e-76
1.02589e-76
7.52697e-76
2.1568e-76
...
)
;
    }
}


// ************************************************************************* //
