TrainCase/case2/0/Mg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Mg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.00335454
0.000217387
0.00433052
6.58286e-05
0.000437676
0.00317666
5.55964e-05
0.000139441
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.58401e-09
2.47085e-10
1.20397e-10
1.08138e-10
1.10867e-10
1.14741e-10
1.17785e-10
1.19274e-10
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.54728e-22
6.20463e-22
1.67059e-21
5.82542e-21
1.73602e-21
6.06288e-21
3.69114e-21
1.76793e-21
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0273744
0.0395337
0.0582027
0.0444237
0.0459108
0.045792
0.0463447
0.0460843
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.55829e-21
1.68924e-21
2.29858e-21
2.01112e-21
2.39998e-21
2.21049e-21
4.20489e-21
3.80563e-21
...
)
;
    }
}


// ************************************************************************* //
