TrainCase/case2/0/Rekd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Rekd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.00756719
0.00200438
0.010012
0.00103367
0.00224142
0.0104156
0.00093545
0.00113698
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
5.79504e-19
4.72995e-19
3.86108e-19
3.72243e-19
3.62295e-19
3.60189e-19
3.60935e-19
3.60651e-19
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2547.39
2342.04
2153.25
1979.67
1820.1
1673.4
1538.52
1414.52
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
81.1876
116.331
111.761
107.051
106.845
103.77
104.161
102.67
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
3472.94
3472.32
3471.82
3471.43
3471.17
3471.04
3471.03
3471.15
...
)
;
    }
}


// ************************************************************************* //
