TrainCase/case2/0/Res
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Res;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.708111
0.380345
0.999986
0.207823
0.994329
1
0.187739
0.92379
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.22784e-19
1.90811e-20
9.33721e-21
8.40439e-21
8.62961e-21
8.93975e-21
9.18447e-21
9.30783e-21
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.12036e-09
5.98773e-09
1.36969e-08
3.95302e-08
1.0871e-08
2.93892e-08
1.52638e-08
7.43482e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
3.70604e-08
4.31071e-08
5.81197e-08
4.47544e-08
5.00464e-08
4.85868e-08
9.63999e-08
9.0816e-08
...
)
;
    }
}


// ************************************************************************* //
