TrainCase/case2/0/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
410.11
357.372
422.909
351.731
375.86
414.576
351.595
363.718
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
344.309
344.309
344.308
344.309
344.308
344.308
344.309
344.309
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 160.997;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
437.22
419.862
442.847
450.003
451.857
456.968
457.351
459.969
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 160.997;
    }
}


// ************************************************************************* //
