TrainCase/case2/0/q3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      q3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.00754241
0.00200409
0.00998734
0.00103363
0.00224115
0.0103984
0.000935422
0.00113695
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
5.79504e-19
4.72995e-19
3.86108e-19
3.72243e-19
3.62295e-19
3.60189e-19
3.60935e-19
3.60651e-19
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 2;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2
2
2
2
2
2
2
2
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 2;
    }
}


// ************************************************************************* //
