TrainCase/case2/0/wallDistance
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallDistance;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
5.01517e-06
5.0225e-06
1.5899e-05
5.0118e-06
1.55556e-05
2.61715e-05
5.00648e-06
1.51272e-05
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.234483
0.215581
0.198203
0.182226
0.167537
0.154033
0.141619
0.130205
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0025001
0.00249964
0.00249991
0.00250051
0.00250046
0.00250033
0.00250055
0.00250081
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0.319678
0.319621
0.319575
0.31954
0.319515
0.319503
0.319503
0.319513
...
)
;
    }
}


// ************************************************************************* //
