TrainCase/case2/0/xx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      xx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.00328564
0.000143182
0.00246978
3.60052e-05
0.000120328
0.00165625
2.94476e-05
3.04074e-05
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.00940838;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.25313
6.52468
7.87116
14.0969
18.6646
22.9789
28.1215
32.7994
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.00940838;
    }
}


// ************************************************************************* //
